"Favorites" = "お気に入り";
"iCloud Sync" = "iCloud同期";
"Browse the smartphone site" = "スマートフォン用サイトの閲覧";
"したらば" = "したらば";
"Shake" = "シェイク";
"Do nothing" = "何もしない";
"Update channels" = "番組情報更新";
"Play random" = "ランダムな番組を再生";